{
    "Home": " Accuil ",
    "FR" : "EN",
    "About": "À propos",
    "Skills": "Compétences",
    "Articles": "Articles",
    "Contact": "Contact",
    "Hey 👋, I am Abdelmouhaimene" : "Salut 👋, Je suis Abdelmouhaimene" , 
    "Full-stack web developer, and software engineer.": "Développeur web Full-stack et ingénieur logiciel.",
    "I am a full-stack developer with expertise in Node.js. I have some experience in building scalable, secure and reliable web applications using MERN stack frameworks and liberaries, I noted that i am a skilled front-end developer with a strong command of React. I enjoy learning new skills. I am passionate about creating high-quality code that follows best practices and industry standards. I am always looking for new challenges and opportunities to grow as a developer.": "Je suis un développeur full-stack avec une expertise en Node.js. J'ai une certaine expérience dans la construction d'applications web évolutives, sécurisées et fiables en utilisant des frameworks et des bibliothèques de la pile MERN. J'ai noté que je suis un développeur front-end compétent avec une solide maîtrise de React. J'aime apprendre de nouvelles compétences. Je suis passionné par la création de code de haute qualité qui suit les meilleures pratiques et les normes de l'industrie. Je suis toujours à la recherche de nouveaux défis et d'opportunités pour évoluer en tant que développeur.",
    "Download CV" : "Télécharger le CV",
    "Work":"Travail",
    "Full-stack web developper":"Développeur web Full-stack",
    "Read article" : "Lire l'article",
    "Top 10 Architectural Patterns for software developpment" : "Les 10 principales architectures logicielles pour le développement de logiciels",
    "software architecture is the process of designing the structure and behavior of a software system, which includes making decisions about components, modules, interfaces, and the organization of the system. ": "L'architecture logicielle est le processus de conception de la structure et du comportement d'un système logiciel, ce qui inclut la prise de décisions concernant les composants, les modules, les interfaces et l'organisation du système.",
    "Why You Should Use React.js For Web Development":"Pourquoi vous devriez utiliser React.js pour le développement Web",
    "If you are new to React.js, you must be wondering why it is so popular and why you should use it in your applications. If so, then you are in the right place." :"Si vous êtes nouveau sur React.js, vous devez vous demander pourquoi il est si populaire et pourquoi vous devriez l'utiliser dans vos applications. Si oui, alors vous êtes au bon endroit.",
    "I’ m Abdelmouhaimene Assila. I’m from Algeria, I have a  master degree in software engineering.": "Je m'appelle Abdelmouhaimene Assila. Je viens d'Algérie et je suis titulaire d'un master en génie logiciel.",
    "I'm passionate about pushing the boundaries of what's possible and inspiring the next generation of innovators.": "Je suis passionné par repousser les limites de ce qui est possible et inspirer la prochaine génération d'innovateurs.",
    "Chronological collection of my long-form thoughts on programming, leadership, product design, and more.": "Collection chronologique de mes réflexions approfondies sur la programmation, le leadership, la conception de produits et bien plus encore.",
    "Follow on":"Suivre sur",
    "Thank you for your interest in getting in touch with me. I welcome your feedback, questions, and suggestions. If you have a specific question or comment, please feel free to email me directly at" : "Merci de votre intérêt à me contacter. Je suis ouvert à vos commentaires, questions et suggestions. Si vous avez une question ou un commentaire spécifique, n'hésitez pas à m'envoyer un courrier électronique directement à",
    "Let's Get in Touch: Ways to Connect with Me" : "Restons en contact : Moyens de me contacter",
    "I make an effort to respond to all messages within 24 hours, although it may take me longer during busy periods. Alternatively, you can use the contact form on my website to get in touch. Simply fill out the required fields and I'll get back to you as soon as possible. Finally, if you prefer to connect on social media, you can find me on": "Je m'efforce de répondre à tous les messages dans les 24 heures, bien que cela puisse prendre plus de temps pendant les périodes chargées. Vous pouvez également utiliser le formulaire de contact sur mon site Web pour me joindre. Il vous suffit de remplir les champs requis et je vous répondrai dès que possible. Enfin, si vous préférez me contacter sur les réseaux sociaux, vous pouvez me trouver sur",
    "I post regular updates and engage with my followers there, so don't hesitate to reach out. Thanks again for your interest, and I look forward to hearing from you!" : "Je publie régulièrement des mises à jour et j'interagis avec mes abonnés là-bas, alors n'hésitez pas à me contacter. Merci encore pour votre intérêt et j'attends avec impatience de vos nouvelles !"


}