{
    "Home": " Accuil ",
    "FR" : "EN",
    "About": "À propos",
    "Skills": "Compétences",
    "Articles": "Articles",
    "Contact": "Contact",
    "Hey 👋, I am Abdelmouhaimene" : "Salut 👋, Je suis Abdelmouhaimene" , 
    "Full-stack web developer, and software engineer.": "Développeur web Full-stack et ingénieur logiciel.",
    "I am a full-stack developer with expertise in Node.js. I have some experience in building scalable, secure and reliable web applications using MERN stack frameworks and liberaries, I noted that i am a skilled front-end developer with a strong command of React. I enjoy learning new skills. I am passionate about creating high-quality code that follows best practices and industry standards. I am always looking for new challenges and opportunities to grow as a developer.": "Je suis un développeur full-stack avec une expertise en Node.js. J'ai une certaine expérience dans la construction d'applications web évolutives, sécurisées et fiables en utilisant des frameworks et des bibliothèques de la pile MERN. J'ai noté que je suis un développeur front-end compétent avec une solide maîtrise de React. J'aime apprendre de nouvelles compétences. Je suis passionné par la création de code de haute qualité qui suit les meilleures pratiques et les normes de l'industrie. Je suis toujours à la recherche de nouveaux défis et d'opportunités pour évoluer en tant que développeur.",
    "Download CV" : "Télécharger le CV",
    "Work":"Travail",
    "Full-stack web developper":"Développeur web Full-stack",
    "Read article" : "Lire l'article",
    "Top 10 Architectural Patterns for software developpment" : "Les 10 principales architectures logicielles pour le développement de logiciels",
    "software architecture is the process of designing the structure and behavior of a software system, which includes making decisions about components, modules, interfaces, and the organization of the system. ": "L'architecture logicielle est le processus de conception de la structure et du comportement d'un système logiciel, ce qui inclut la prise de décisions concernant les composants, les modules, les interfaces et l'organisation du système.",
    "Why You Should Use React.js For Web Development":"Pourquoi vous devriez utiliser React.js pour le développement Web",
    "If you are new to React.js, you must be wondering why it is so popular and why you should use it in your applications. If so, then you are in the right place." :"Si vous êtes nouveau sur React.js, vous devez vous demander pourquoi il est si populaire et pourquoi vous devriez l'utiliser dans vos applications. Si oui, alors vous êtes au bon endroit.",
    "I’ m Abdelmouhaimene Assila. I’m from Algeria, I have a  master degree in software engineering.": "Je m'appelle Abdelmouhaimene Assila. Je viens d'Algérie et je suis titulaire d'un master en génie logiciel.",
    "I'm passionate about pushing the boundaries of what's possible and inspiring the next generation of innovators.": "Je suis passionné par repousser les limites de ce qui est possible et inspirer la prochaine génération d'innovateurs.",
    "Chronological collection of my long-form thoughts on programming, leadership, product design, and more.": "Collection chronologique de mes réflexions approfondies sur la programmation, le leadership, la conception de produits et bien plus encore.",
    "Follow on":"Suivre sur",
    "Thank you for your interest in getting in touch with me. I welcome your feedback, questions, and suggestions. If you have a specific question or comment, please feel free to email me directly at" : "Merci de votre intérêt à me contacter. Je suis ouvert à vos commentaires, questions et suggestions. Si vous avez une question ou un commentaire spécifique, n'hésitez pas à m'envoyer un courrier électronique directement à",
    "Let's Get in Touch: Ways to Connect with Me" : "Restons en contact : Moyens de me contacter",
    "I make an effort to respond to all messages within 24 hours, although it may take me longer during busy periods. Alternatively, you can use the contact form on my website to get in touch. Simply fill out the required fields and I'll get back to you as soon as possible. Finally, if you prefer to connect on social media, you can find me on": "Je m'efforce de répondre à tous les messages dans les 24 heures, bien que cela puisse prendre plus de temps pendant les périodes chargées. Vous pouvez également utiliser le formulaire de contact sur mon site Web pour me joindre. Il vous suffit de remplir les champs requis et je vous répondrai dès que possible. Enfin, si vous préférez me contacter sur les réseaux sociaux, vous pouvez me trouver sur",
    "I post regular updates and engage with my followers there, so don't hesitate to reach out. Thanks again for your interest, and I look forward to hearing from you!" : "Je publie régulièrement des mises à jour et j'interagis avec mes abonnés là-bas, alors n'hésitez pas à me contacter. Merci encore pour votre intérêt et j'attends avec impatience de vos nouvelles !",
    "I've worked on some projects during the university years, and over the mounths i worked on NEW DIGITAL WAY, especially in frontend development using React.js and software design and so database architecture. I am highly driven and motivated to excel and grow within the field of development and software engineering.":"J'ai travaillé sur certains projets pendant les années universitaires, et au fil des mois, j'ai travaillé sur NEW DIGITAL WAY, en particulier dans le développement frontend en utilisant React.js et la conception de logiciels et donc l'architecture de base de données. Je suis très motivé et motivé pour exceller et grandir dans le domaine du développement et du génie logiciel.",
    "Things I’ve made trying to put my dent in theuniverse.":"Des choses que j'ai faites en essayant de mettre ma marque dans l'univers.",
    "My love for programming has always motivated me to learn more technologies and develop myself in this field. I started my way from algorithms and C language to object-oriented programming and web development. I mastered some languages, the most important of which are Java and JavaScript, in addition to HTML and CSS. I have experience with Dart and Python, but I'm still on my way to mastering it well." : "Mon amour pour la programmation m'a toujours motivé à apprendre davantage de technologies et à me développer dans ce domaine. J'ai commencé mon parcours avec les algorithmes et le langage C pour ensuite passer à la programmation orientée objet et au développement web. J'ai maîtrisé plusieurs langages, parmi lesquels Java et JavaScript, ainsi que HTML et CSS qui sont les plus importants. J'ai également de l'expérience avec Dart et Python, mais je suis encore en chemin pour les maîtriser complètement.",
    "As a skilled JavaScript developer, I possess a deep understanding of the language's core concepts and advanced techniques. With my expertise in JavaScript, I consistently deliver efficient, scalable, and innovative solutions that exceed expectations." : "En tant que développeur JavaScript compétent, je possède une compréhension approfondie des concepts fondamentaux et des techniques avancées du langage. J'ai conçu et mis en œuvre avec succès des applications web robustes en utilisant des frameworks tels que React et Node.js. Grâce à mon expertise en JavaScript, je propose constamment des solutions efficaces, évolutives et innovantes qui dépassent les attentes.",
    "efficiency" : "efficacité",
    "I have gained extensive experience working as a front-end developer on numerous React projects. My proficiency lies in utilizing React hooks, state management, and essential libraries such as Redux, Redux Persist, Axios, i18n, and React Hook Form, among others." : "J'ai acquis une vaste expérience en tant que développeur front-end sur de nombreux projets en React. Ma compétence réside dans l'utilisation des hooks, de la gestion de l'état et des bibliothèques essentielles telles que Redux, Redux Persist, Axios, i18n et React Hook Form, entre autres. J'ai utilisé avec succès ces outils pour créer des applications web efficaces et conviviales, offrant une fonctionnalité fluide et d'excellentes performances.",
    "Intern":"Stagiaire",
    "I am skilled in creating APIs using Express.js and adept at solving various problems and managing different scenarios using the necessary libraries (JWT, bcrypt, multer, mongoose, sequelize, helmet, Passport, morgan, cors , ...).":"Je suis compétent dans la création d'API avec Express.js et habile à résoudre divers problèmes ainsi qu'à gérer différents scénarios en utilisant les bibliothèques nécessaires (JWT, bcrypt, multer, mongoose, sequelize, helmet, Passport, morgan, cors , ...).",
    "I possess expert-level proficiency in HTML5, allowing me to seamlessly utilize it across various frameworks and programming languages, as well as effectively troubleshoot and resolve any kind of issues or bugs that may arise.":"Je possède une expertise de niveau expert en HTML5, ce qui me permet de l'utiliser aisément avec différents frameworks et langages de programmation, ainsi que de résoudre efficacement tout type de problèmes ou de bugs qui pourraient survenir.",
    "As a front-end developer, I excel in CSS, effortlessly handling various design styles with meticulous attention to detail, including intricate layouts, animations, and subtle nuances. I am proficient in utilizing different styling frameworks such as Styled Components, Material UI, and Bootstrap.":"En tant que développeur front-end, je suis un expert en CSS, capable de gérer avec aisance différents types de designs, en accordant une attention méticuleuse aux détails, y compris les mises en page complexes, les animations et les subtilités. Je maîtrise l'utilisation de différents frameworks de stylisme tels que Styled Components, Material UI et Bootstrap.",
    "Generally, I rely on Bootstrap for styling, as I am highly proficient in it and acknowledge its ability to simplify development. However, in pursuit of optimization and improved speed, I have been utilizing it less frequently in recent times.":"Généralement, j'utilise Bootstrap pour le stylisme, car je le maîtrise parfaitement et il facilite grandement le développement. Cependant, ces derniers temps, j'ai réduit son utilisation afin d'optimiser les performances et la vitesse.",
    "I have built numerous APIs using MongoDB, which is a NoSQL database. I am accustomed to working with the Mongoose library, which simplifies schema management and interaction.":"J'ai construit de nombreuses API en utilisant MongoDB, qui est une base de données NoSQL. J'ai l'habitude de travailler avec la bibliothèque Mongoose pour faciliter la manipulation des schémas.",
    "Since 2019, I have been extensively using SQL databases, demonstrating proficiency in Oracle, MySQL, and PostgreSQL. When working with Node.js, I prefer utilizing the Sequelize library to interact with SQL databases, as it provides a seamless and efficient experience.":"Depuis 2019, j'utilise régulièrement des bases de données SQL, démontrant une bonne maîtrise d'Oracle, MySQL et PostgreSQL. Lorsque je travaille avec Node.js, j'ai une préférence pour l'utilisation de la bibliothèque Sequelize, qui me permet d'interagir efficacement avec les bases de données SQL.",
    "I have gained valuable theoretical expertise in Web 3 through my work on it during my master's degree graduation project. Specifically, I focused on decentralized databases using RDF format and implemented them on the Solid platform, which was pioneered by Sir Tim Berners-Lee, the inventor of the World Wide Web.":"J'ai acquis une solide expérience sur le plan théorique en matière de Web 3 grâce à mon projet de fin d'études pour l'obtention de mon diplôme de maîtrise. J'ai travaillé sur les bases de données décentralisées au format RDF et les ai construites sur la plateforme Solid, créée par Sir Tim Berners-Lee, l'inventeur du World Wide Web.",
    "All Rights Reserved":"Tous les droits sont réservés"

}